       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLOWORLD.

       ENVIRONMENT DIVISION.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  WS-MESSAGE       PIC X(20) VALUE SPACES.

       PROCEDURE DIVISION.
           MOVE "helloworld" TO WS-MESSAGE.
           DISPLAY WS-MESSAGE.
           STOP RUN.
